Repository: carlosdavis/drupal6_sites_all
Catalog: modules/contrib/custom_pagers/translations/*.po
Languages: hu

source: edit
hu: szerkesztés

source: Delete
hu: Törlés

source: ‹ previous
hu: ‹ előző

source: next ›
hu: következő ›

source: Title
hu: Cím

source: Visibility
hu: Láthatóság

source: Submit
hu: Beküldés

source: Placeholder tokens
hu: Helykitöltő vezérjelek

source: View arguments
hu: A nézet paraméterei

source: Warning
hu: Figyelmeztetés

source: Pager position
hu: Lapozó elhelyezkedése

source: Node list
hu: Tartalomlista

source: PHP snippet
hu: PHP kód

source: view
hu: nézet

source: nodes
hu: tartalmak

source: No custom pagers have been defined.
hu: Nincs felvett egyedi lapozó.

source: Add a new custom pager
hu: Egyedi lapozó hozzáadása

source: Above the node's body
hu: A tartalom törzse felett

source: Below the node's body
hu: A tartalom törzse alatt

source: Both above and below the node's body
hu: A tartalom törzse alatt és felett is

source: In a sidebar block
hu: Egy oldalsáv blokkban

source: The node type(s) this custom pager will apply to.
hu: Azok a tartalomtípusok, melyekhez ez a lapozó tartozik.

source: Pager visibility
hu: A lapozó láthatósága

source: Determine what nodes this pager should be displayed on.
hu: Meghatározza azon tartalomtípusokat, amelyeknél a lapozó megjelenik.

source: Note
hu: Megjegyzés

source: This pager uses custom PHP snippets to control visibility. You do not have permission to use PHP snippets, and the changes you make to this field will be ignored.
hu: Ez a lapozó egyedi PHP kód alapján határozza meg láthatóságát. Ha nincs megfelelő jogosultság a PHP kódok használatához, akkor ezen mező változások nem lesznek figyelembe véve.

source: By node type
hu: Tartalomtípus szerint

source: If the PHP field is filled in, this field will be ignored.
hu: A mező értéke nem lesz figyelembe véve, ha a <em>PHP kód által</em>mező ki van töltve.

source: By PHP snippet
hu: PHP kód által

source: Use a snippet of PHP to return TRUE or FALSE. Note that this code has access to the $node variable, and can check its type or any other property. If this field is filled out, the <em>By node type</em> field will be ignored.
hu: A PHP kódnak TRUE vagy FALSE értékkel kell visszatérnie. Ez a kód eléri a $node változót, lekérdezhető a típusa, vagy bármely más tulajdonsága. Ha ez a mező ki van töltve, akkor a <em>Tartalomtípus szerint</em> mező értéke figyelmen kívül marad.

source: Pager node list
hu: A lapozó tartalomlistája

source: Determine how the list of nodes for this pager should be generated.
hu: A tartalomlista meghatározása a lapozó elkészítéséhez.

source: This pager uses custom PHP snippets to generate a list of nodes. You do not have permission to use PHP snippets, and the changes you make to this field will be ignored.
hu: Ez a lapozó egyedi PHP kód alapján határozza meg tartalomlistát. Ha nincs megfelelő jogosultság a PHP kódok használatához, akkor a mező változások nem lesznek figyelembe véve.

source: The Views module is not installed, and you do not have permission to use PHP snippets to configure the node. You can save this custom pager, but it will not appear until the node list is properly configured.
hu: A <em>Views</em> modul nincs engedélyezve és nincs jogosultság PHP kódot használni a tartalom beállításához. Az egyedi lapozó elmenthető, de a megfelelő tartalomlista beállításáig nem fog megjelenni.

source: Use PHP snippet
hu: PHP kód használata

source: Use a snippet of PHP to populate the pager. The snippet should return an array of node ids in the order they should be browsed. If this field is filled out, the <em>Use a view</em> and <em>View arguments</em> fields will be ignored.
hu: PHP kód használata a lapozó feltöltéséhez. A kódnak egy tartalomazonosító tömbbel kell visszatérnie, abban a sorrendben, ahogy a lapozó lépked. Ha ez a mező ki van töltve, akkor a <em>Nézet használata</em> és a <em>Nézet paraméterei</em> mezők figyelmen kívül maradnak.

source: Use a view
hu: Nézet használata

source: A view used to populate the pager. The nodes will appear in the pager in the same order they are displayed in the view. If the PHP field is populated, this will be ignored.
hu: Nézet a lapozó feltöltéséhez. A tartalmak abban a sorrendben jelennek meg a lapozóban, ahogy a nézetben is vannak. Ha a <em>PHP kód használata</em> mező ki van töltve, akkor ez a mező figyelmen kívül marad.

source: A return-delimited list of arguments to pass into the selected view. If Token.module is enabled, placeholder tokens like [type] and [author] can be used.
hu: Paraméterek a kiválasztott nézetnek, minden paraméter külön sorban. Ha a <em>Token</em> modul engedélyezett, akkor a helykitöltő vezérjelek is használhatók, pl. [type] és [author].

source: The following placeholder tokens can be used when passing arguments into the view. Each will be replaced with the correct values at runtime.
hu: A következő helykitöltő vezérjelek használhatók a nézetek paraméter átadásakor. Mindegyik a megfelelő értéket veszi fel futás közben.

source: To use dynamic placeholder tokens in your pager arguments (the ID of the current node or currently logged in user, for example), download and install the <a href='@token'>Token module</a> from Drupal.org.
hu: Dinamikus helykitöltő vezérjelek lapozó paraméterként történő használatához (pl. az aktuális tartalom azonosítója, bejelentkezett felhasználó), a <a href='@token'>Token</a> modult kell telepíteni a Drupal.org oldalról.

source: Reverse the list of nodes
hu: A tartalomlista sorrendjének megfordítása

source: The natural list view ordering for an archive is the opposite of the natural 'previous/next' order for a pager. As such, reversing the pager list is useful when using a single view for paging and other sorted lists (pages, blocks, etc).
hu: A természetes archívum lista nézet sorrendje pont az ellenkezője a természetes „előző/következő” lapozó sorrendnek. Ezért, a lapozó sorrend megfordítása hasznos, ha egy nézet áll rendelkezésre a lapozóhoz és egyéb rendezett listákhoz is (oldalak, blokkok, stb.).

source: Cache the list of nodes
hu: A tartalomlista gyorstárazása

source: @count of @count_total
hu: @count / @count_total

source: administer custom pagers
hu: egyedi lapozók adminisztrációja

source: use php in custom pagers
hu: PHP használata egyedi lapozókban

source: Custom pagers
hu: Egyedi lapozók

source: Add custom pagers for content types.
hu: Tartalomtípusokhoz egyedi lapozó felvitele

source: Add custom pager
hu: Egyedi lapozó felvitele

source: Edit custom pager
hu: Egyedi lapozó szerkesztése

source: Stores data for previous/next pagers to be added to nodes.
hu: A tartalomhoz hozzárendelt előző/következő stílusú lapozó adatait tárolja.

source: Unique identifier for the {custom_pager}.
hu: A {custom_pager} egyedi azonosítója.

source: The visible title of the {custom_pager}.
hu: A {custom_pager} látható címe

source: Raw PHP to populate this {custom_pager}.
hu: Nyers PHP kód amely feltölti a {custom_pager} tartalmait.

source: The name of the view used for this {custom_pager}.
hu: A {custom_pager} által használt nézet neve.

source: A serialized array of arguments for the {custom_pager}'s view.
hu: Szerializált tömb a {custom_pager} nézetének argumentumaival.

source: The position where this {custom_pager} should be displayed.
hu: A {custom_pager} elhelyezkedése, ahol meg kell jelennie.

source: Raw PHP to determine when the {custom_pager} should be displayed.
hu: Nyers PHP kód amely meghatározza a {custom_pager} láthatóságát.

source: A specific node type this {custom_pager} should be displayed with.
hu: A tartalom típus melyhez a {custom_pager} tartozik.

source: A boolean flag indicating that this {custom_pager} should be displayed in reverse order.
hu: Jelző érték, mely meghatározza, hogy a {custom_pager} fordított sorrenddel működjön, vagy nem.

source: A boolean flag indicating that this {custom_pager}'s list of nodes should be cached.
hu: Jelző érték, mely megmutatja, hogy a {custom_pager} tartalomlistája gyorstárazva legyen, vagy nem.

source: Allows administrators to define custom pagers for navigation in lists of nodes.
hu: Lehetővé teszi az adminisztrátorok számára egyedi lapozó készítését tartalomlistákban történő navigáláshoz.
